
/*
Напишите программу, которая на вход принимает число и выдает
его квадрат (число умноженное на само себя).
*/

System.Console.WriteLine("Введите число: ");// быстрый вызов cw enter

int userNumber = Convert.ToInt32(Console.ReadLine());

int result = userNumber * userNumber;
System.Console.WriteLine(result);
System.Console.WriteLine(userNumber * userNumber);
